In [8]:
import sqlite3

In [9]:
db=sqlite3.connect('database.db')

In [10]:
cur=db.cursor()

In [11]:
cur.execute('create table student (id int primary key, firstname varchar(30),secondname varchar(30),marks int, City text)')

OperationalError: table student already exists

In [12]:
cur.execute("insert into student values (1,'Mohit','Tomar',60,'Delhi')")

OperationalError: table student has 7 columns but 5 values were supplied

In [13]:
entiti= [(2,'Swati','Tomar',85,'sydney'),(3,'Ajay','Panwar',85,'Laxmi Nagar'),(4,'Rakesh','Devi',99,'Uttaranchal'),(5,'Monika','Goliyan',90,'Gurgaon'),(6,'Tabu','Tomar',100,'Delhi'),(7,'Gaurav','Sirohi',80,'Uttam nagar'),(8,'Monu',' ',72,'Rajiv chowk'),(9,'Siddharth','jhunjhun wala',46,'Malakpur'),(10,'sameer','jhoka',29,'Hyderabad')   ]

In [14]:
cur.executemany("insert into student values (?,?,?,?,?)",entiti)

OperationalError: table student has 7 columns but 5 values were supplied

In [15]:
cur.execute('select * from student')
cur.fetchall()

[(1, 'Mohit', 'Tomar', 60, 'Delhi', None, None),
 (2, 'Swati', 'Tomar', 85, 'sydney', None, None),
 (3, 'Ajay', 'Panwar', 85, 'Laxmi Nagar', None, None),
 (4, 'Rakesh', 'Devi', 99, 'Uttaranchal', None, None),
 (5, 'Monika', 'Goliyan', 90, 'Gurgaon', None, None),
 (6, 'Tabu', 'Tomar', 100, 'Delhi', None, None),
 (7, 'Gaurav', 'Sirohi', 80, 'Uttam nagar', None, None),
 (8, 'Monu', None, 72, 'Rajiv chowk', None, None),
 (9, 'Siddharth', 'jhunjhun wala', 46, 'Malakpur', None, None),
 (10, 'sameer', 'jhoka', 29, 'Hyderabad', None, None)]

In [16]:
# create a function to run query

def sql_query(sql):
    cur.execute(sql)
    return cur.fetchall()

In [17]:
sql='select * from student'
sql_query(sql)

[(1, 'Mohit', 'Tomar', 60, 'Delhi', None, None),
 (2, 'Swati', 'Tomar', 85, 'sydney', None, None),
 (3, 'Ajay', 'Panwar', 85, 'Laxmi Nagar', None, None),
 (4, 'Rakesh', 'Devi', 99, 'Uttaranchal', None, None),
 (5, 'Monika', 'Goliyan', 90, 'Gurgaon', None, None),
 (6, 'Tabu', 'Tomar', 100, 'Delhi', None, None),
 (7, 'Gaurav', 'Sirohi', 80, 'Uttam nagar', None, None),
 (8, 'Monu', None, 72, 'Rajiv chowk', None, None),
 (9, 'Siddharth', 'jhunjhun wala', 46, 'Malakpur', None, None),
 (10, 'sameer', 'jhoka', 29, 'Hyderabad', None, None)]

In [18]:
sql='select distinct secondname, firstname from student'

sql_query(sql)

[('Tomar', 'Mohit'),
 ('Tomar', 'Swati'),
 ('Panwar', 'Ajay'),
 ('Devi', 'Rakesh'),
 ('Goliyan', 'Monika'),
 ('Tomar', 'Tabu'),
 ('Sirohi', 'Gaurav'),
 (None, 'Monu'),
 ('jhunjhun wala', 'Siddharth'),
 ('jhoka', 'sameer')]

In [19]:
sql="select firstname from student where secondname='Tomar' and marks>=90"

sql_query(sql)

[('Tabu',)]

In [20]:
sql="select firstname from student where marks between 80 and 90"

sql_query(sql)

[('Swati',), ('Ajay',), ('Monika',), ('Gaurav',)]

In [21]:
sql="select firstname from student where secondname='Tomar' or marks<50"

sql_query(sql)

[('Mohit',), ('Swati',), ('Tabu',), ('Siddharth',), ('sameer',)]

In [22]:
#where not

sql="select firstname from student where not secondname='Tomar'"

sql_query(sql)

[('Ajay',), ('Rakesh',), ('Monika',), ('Gaurav',), ('Siddharth',), ('sameer',)]

In [23]:
# order by

sql="select firstname from student order by firstname"

sql_query(sql)

[('Ajay',),
 ('Gaurav',),
 ('Mohit',),
 ('Monika',),
 ('Monu',),
 ('Rakesh',),
 ('Siddharth',),
 ('Swati',),
 ('Tabu',),
 ('sameer',)]

In [24]:
# top clause
sql="select firstname from student limit 7"

sql_query(sql)

[('Mohit',),
 ('Swati',),
 ('Ajay',),
 ('Rakesh',),
 ('Monika',),
 ('Tabu',),
 ('Gaurav',)]

In [25]:
# Min() and max

sql="select max(marks) from student where secondname='Tomar'"

sql_query(sql)

[(100,)]

In [26]:
# count

sql="select count(firstname) from student where marks between 80 and 100 "

sql_query(sql)

[(6,)]

In [27]:
# AVG

sql="select avg(marks),secondname from student where secondname ='Tomar'"

sql_query(sql)

[(81.66666666666667, 'Tomar')]

In [28]:
# sum

sql="select sum(marks) from student"

sql_query(sql)

[(746,)]

In [29]:
#like operator

sql="select firstname, secondname from student where firstname like '__h%'"

sql_query(sql)

[('Mohit', 'Tomar')]

In [30]:
# in and not operator

sql="select firstname, secondname from student where marks in (90,80,100,85)"

sql_query(sql)

[('Swati', 'Tomar'),
 ('Ajay', 'Panwar'),
 ('Monika', 'Goliyan'),
 ('Tabu', 'Tomar'),
 ('Gaurav', 'Sirohi')]

In [31]:
sql="select firstname, secondname from student where marks not in (90,80,100,85)"

sql_query(sql)

[('Mohit', 'Tomar'),
 ('Rakesh', 'Devi'),
 ('Monu', None),
 ('Siddharth', 'jhunjhun wala'),
 ('sameer', 'jhoka')]

In [32]:
# alias

sql="select firstname as f, secondname as s from student where marks not in (90,80,100,85)"

sql_query(sql)

[('Mohit', 'Tomar'),
 ('Rakesh', 'Devi'),
 ('Monu', None),
 ('Siddharth', 'jhunjhun wala'),
 ('sameer', 'jhoka')]

In [33]:
# alias

sql="select s.firstname , s.secondname from student as s where marks not in (90,80,100,85)"

sql_query(sql)

[('Mohit', 'Tomar'),
 ('Rakesh', 'Devi'),
 ('Monu', None),
 ('Siddharth', 'jhunjhun wala'),
 ('sameer', 'jhoka')]

In [34]:
# Having

sql="select * from country group by continent having count(region)>6"

sql_query(sql)

OperationalError: no such table: country

In [35]:
# Having

sql="select * from student group by secondname having count(secondname)>1"

sql_query(sql)

[(1, 'Mohit', 'Tomar', 60, 'Delhi', None, None)]

In [36]:
# create another table

cur.execute('create table studentprofession (id int primary key, company varchar(30),profile varchar(30),salary int, rank text)')

OperationalError: table studentprofession already exists

In [37]:
cur.execute("insert into studentprofession values (1,'HCL','IT',30000,3)  ")

IntegrityError: UNIQUE constraint failed: studentprofession.id

In [38]:
entiti= [(2,'Infosis','executive',85000,2),(3,'google','software',70000,5),(4,'facebook','tester',9900,4),(5,'google','sales',72000,4),(6,'TCS','engineer',100000,1),(7,'HDFC','Banker',80000,6),(8,'Motherson','designer',72000,7),(9,'Zee','anchor',46000,6),(10,'sun pharma','doctor',29000,4)   ]

In [39]:
cur.executemany("insert into studentprofession values (?,?,?,?,?)",entiti)

IntegrityError: UNIQUE constraint failed: studentprofession.id

In [40]:
cur.execute("select * from student")
cur.fetchall()

[(1, 'Mohit', 'Tomar', 60, 'Delhi', None, None),
 (2, 'Swati', 'Tomar', 85, 'sydney', None, None),
 (3, 'Ajay', 'Panwar', 85, 'Laxmi Nagar', None, None),
 (4, 'Rakesh', 'Devi', 99, 'Uttaranchal', None, None),
 (5, 'Monika', 'Goliyan', 90, 'Gurgaon', None, None),
 (6, 'Tabu', 'Tomar', 100, 'Delhi', None, None),
 (7, 'Gaurav', 'Sirohi', 80, 'Uttam nagar', None, None),
 (8, 'Monu', None, 72, 'Rajiv chowk', None, None),
 (9, 'Siddharth', 'jhunjhun wala', 46, 'Malakpur', None, None),
 (10, 'sameer', 'jhoka', 29, 'Hyderabad', None, None)]

In [41]:
cur.execute("select * from studentprofession")
cur.fetchall()

[(1, 'HCL', 'IT', 30000, '3'),
 (2, 'Infosis', 'executive', 85000, '2'),
 (3, 'google', 'software', 70000, '5'),
 (4, 'facebook', 'tester', 9900, '4'),
 (5, 'google', 'sales', 72000, '4'),
 (6, 'TCS', 'engineer', 100000, '1'),
 (7, 'HDFC', 'Banker', 80000, '6'),
 (8, 'Motherson', 'designer', 72000, '7'),
 (9, 'Zee', 'anchor', 46000, '6'),
 (10, 'sun pharma', 'doctor', 29000, '4'),
 (20, 'Info', 'exec', 85, '9'),
 (11, 'goo', 'soft', 70, '5'),
 (12, 'face', 'tester', 99, '4'),
 (13, 'goo', 'sal', 72, '4'),
 (14, 'TCS', 'engi', 10, '1')]

In [42]:
entiti= [(15,'Info','exec',85,9),(11,'goo','soft',70,5),(12,'face','tester',99,4),(13,'goo','sal',72,4),(14,'TCS','engi',10,1)  ]

In [43]:
cur.executemany("insert into studentprofession values (?,?,?,?,?)",entiti)

IntegrityError: UNIQUE constraint failed: studentprofession.id

In [44]:
cur.execute("select * from studentprofession")
cur.fetchall()

[(1, 'HCL', 'IT', 30000, '3'),
 (2, 'Infosis', 'executive', 85000, '2'),
 (3, 'google', 'software', 70000, '5'),
 (4, 'facebook', 'tester', 9900, '4'),
 (5, 'google', 'sales', 72000, '4'),
 (6, 'TCS', 'engineer', 100000, '1'),
 (7, 'HDFC', 'Banker', 80000, '6'),
 (8, 'Motherson', 'designer', 72000, '7'),
 (9, 'Zee', 'anchor', 46000, '6'),
 (10, 'sun pharma', 'doctor', 29000, '4'),
 (20, 'Info', 'exec', 85, '9'),
 (11, 'goo', 'soft', 70, '5'),
 (12, 'face', 'tester', 99, '4'),
 (13, 'goo', 'sal', 72, '4'),
 (14, 'TCS', 'engi', 10, '1'),
 (15, 'Info', 'exec', 85, '9')]

# JOIN  -    it help in retrieving data from two or more database tables.

In [45]:
# Now we have 2 tables  student and studentprofession

# INNER JOIN

In [46]:
sql="select s.firstname, c.salary from student as s join studentprofession as c on s.id = c.id"

sql_query(sql)

[('Mohit', 30000),
 ('Swati', 85000),
 ('Ajay', 70000),
 ('Rakesh', 9900),
 ('Monika', 72000),
 ('Tabu', 100000),
 ('Gaurav', 80000),
 ('Monu', 72000),
 ('Siddharth', 46000),
 ('sameer', 29000)]

In [47]:
# Left Join

sql="select s.firstname, c.salary from studentprofession as c left join student as s on s.id = c.id"

sql_query(sql)

[('Mohit', 30000),
 ('Swati', 85000),
 ('Ajay', 70000),
 ('Rakesh', 9900),
 ('Monika', 72000),
 ('Tabu', 100000),
 ('Gaurav', 80000),
 ('Monu', 72000),
 ('Siddharth', 46000),
 ('sameer', 29000),
 (None, 85),
 (None, 70),
 (None, 99),
 (None, 72),
 (None, 10),
 (None, 85)]

In [48]:
#  Drop

# sql= 'delete from student where id=4'
# sql= drop table name
# drop database name

In [49]:
d=sqlite3.connect('tt.db')
c=d.cursor()

#c.execute("drop database tt.db")  in sqlite, have to manually ddlete database

In [50]:
sql="desc student"

sql_query(sql)

OperationalError: near "desc": syntax error

In [51]:
# IS NULL    and IS NOT NULL

sql="select * from student where secondname is null"

sql_query(sql)

[(8, 'Monu', None, 72, 'Rajiv chowk', None, None)]

In [52]:
sql="select * from student where secondname is not null"

sql_query(sql)

[(1, 'Mohit', 'Tomar', 60, 'Delhi', None, None),
 (2, 'Swati', 'Tomar', 85, 'sydney', None, None),
 (3, 'Ajay', 'Panwar', 85, 'Laxmi Nagar', None, None),
 (4, 'Rakesh', 'Devi', 99, 'Uttaranchal', None, None),
 (5, 'Monika', 'Goliyan', 90, 'Gurgaon', None, None),
 (6, 'Tabu', 'Tomar', 100, 'Delhi', None, None),
 (7, 'Gaurav', 'Sirohi', 80, 'Uttam nagar', None, None),
 (9, 'Siddharth', 'jhunjhun wala', 46, 'Malakpur', None, None),
 (10, 'sameer', 'jhoka', 29, 'Hyderabad', None, None)]

In [53]:
# UPDATE statement

sql="update studentprofession set id=20 where id=15"

sql_query(sql)

IntegrityError: UNIQUE constraint failed: studentprofession.id

In [54]:
sql="select * from studentprofession"

sql_query(sql)

[(1, 'HCL', 'IT', 30000, '3'),
 (2, 'Infosis', 'executive', 85000, '2'),
 (3, 'google', 'software', 70000, '5'),
 (4, 'facebook', 'tester', 9900, '4'),
 (5, 'google', 'sales', 72000, '4'),
 (6, 'TCS', 'engineer', 100000, '1'),
 (7, 'HDFC', 'Banker', 80000, '6'),
 (8, 'Motherson', 'designer', 72000, '7'),
 (9, 'Zee', 'anchor', 46000, '6'),
 (10, 'sun pharma', 'doctor', 29000, '4'),
 (20, 'Info', 'exec', 85, '9'),
 (11, 'goo', 'soft', 70, '5'),
 (12, 'face', 'tester', 99, '4'),
 (13, 'goo', 'sal', 72, '4'),
 (14, 'TCS', 'engi', 10, '1'),
 (15, 'Info', 'exec', 85, '9')]

In [55]:
sql="update student set secondname=NULL where firstname='Monu'"

sql_query(sql)

[]

In [56]:
sql="select * from student"

sql_query(sql)

[(1, 'Mohit', 'Tomar', 60, 'Delhi', None, None),
 (2, 'Swati', 'Tomar', 85, 'sydney', None, None),
 (3, 'Ajay', 'Panwar', 85, 'Laxmi Nagar', None, None),
 (4, 'Rakesh', 'Devi', 99, 'Uttaranchal', None, None),
 (5, 'Monika', 'Goliyan', 90, 'Gurgaon', None, None),
 (6, 'Tabu', 'Tomar', 100, 'Delhi', None, None),
 (7, 'Gaurav', 'Sirohi', 80, 'Uttam nagar', None, None),
 (8, 'Monu', None, 72, 'Rajiv chowk', None, None),
 (9, 'Siddharth', 'jhunjhun wala', 46, 'Malakpur', None, None),
 (10, 'sameer', 'jhoka', 29, 'Hyderabad', None, None)]

# Alter Table

In [57]:
sql="alter table student add email varchar(30)"

sql_query(sql)

OperationalError: duplicate column name: email

In [58]:
sql="select * from student"

sql_query(sql)

[(1, 'Mohit', 'Tomar', 60, 'Delhi', None, None),
 (2, 'Swati', 'Tomar', 85, 'sydney', None, None),
 (3, 'Ajay', 'Panwar', 85, 'Laxmi Nagar', None, None),
 (4, 'Rakesh', 'Devi', 99, 'Uttaranchal', None, None),
 (5, 'Monika', 'Goliyan', 90, 'Gurgaon', None, None),
 (6, 'Tabu', 'Tomar', 100, 'Delhi', None, None),
 (7, 'Gaurav', 'Sirohi', 80, 'Uttam nagar', None, None),
 (8, 'Monu', None, 72, 'Rajiv chowk', None, None),
 (9, 'Siddharth', 'jhunjhun wala', 46, 'Malakpur', None, None),
 (10, 'sameer', 'jhoka', 29, 'Hyderabad', None, None)]

In [59]:
# modify column

sql="alter table student add column dob date"

sql_query(sql)

OperationalError: duplicate column name: dob

In [60]:
sql="select * from student"

sql_query(sql)

[(1, 'Mohit', 'Tomar', 60, 'Delhi', None, None),
 (2, 'Swati', 'Tomar', 85, 'sydney', None, None),
 (3, 'Ajay', 'Panwar', 85, 'Laxmi Nagar', None, None),
 (4, 'Rakesh', 'Devi', 99, 'Uttaranchal', None, None),
 (5, 'Monika', 'Goliyan', 90, 'Gurgaon', None, None),
 (6, 'Tabu', 'Tomar', 100, 'Delhi', None, None),
 (7, 'Gaurav', 'Sirohi', 80, 'Uttam nagar', None, None),
 (8, 'Monu', None, 72, 'Rajiv chowk', None, None),
 (9, 'Siddharth', 'jhunjhun wala', 46, 'Malakpur', None, None),
 (10, 'sameer', 'jhoka', 29, 'Hyderabad', None, None)]

In [61]:
# modify column datatype
sql="alter table student modify dob year"

sql_query(sql)

OperationalError: near "modify": syntax error

In [62]:
sql="select * from student"

sql_query(sql)

[(1, 'Mohit', 'Tomar', 60, 'Delhi', None, None),
 (2, 'Swati', 'Tomar', 85, 'sydney', None, None),
 (3, 'Ajay', 'Panwar', 85, 'Laxmi Nagar', None, None),
 (4, 'Rakesh', 'Devi', 99, 'Uttaranchal', None, None),
 (5, 'Monika', 'Goliyan', 90, 'Gurgaon', None, None),
 (6, 'Tabu', 'Tomar', 100, 'Delhi', None, None),
 (7, 'Gaurav', 'Sirohi', 80, 'Uttam nagar', None, None),
 (8, 'Monu', None, 72, 'Rajiv chowk', None, None),
 (9, 'Siddharth', 'jhunjhun wala', 46, 'Malakpur', None, None),
 (10, 'sameer', 'jhoka', 29, 'Hyderabad', None, None)]

In [63]:

db.commit()

In [64]:
# fill last columns

sql="update student set email='mohit@google.com' where id=1"

sql_query(sql)

[]

In [65]:
sql="select * from student"

sql_query(sql)

[(1, 'Mohit', 'Tomar', 60, 'Delhi', 'mohit@google.com', None),
 (2, 'Swati', 'Tomar', 85, 'sydney', None, None),
 (3, 'Ajay', 'Panwar', 85, 'Laxmi Nagar', None, None),
 (4, 'Rakesh', 'Devi', 99, 'Uttaranchal', None, None),
 (5, 'Monika', 'Goliyan', 90, 'Gurgaon', None, None),
 (6, 'Tabu', 'Tomar', 100, 'Delhi', None, None),
 (7, 'Gaurav', 'Sirohi', 80, 'Uttam nagar', None, None),
 (8, 'Monu', None, 72, 'Rajiv chowk', None, None),
 (9, 'Siddharth', 'jhunjhun wala', 46, 'Malakpur', None, None),
 (10, 'sameer', 'jhoka', 29, 'Hyderabad', None, None)]

In [66]:
# Default constraint

sql="alter table student alter email set default 'xyz@google.com'"

sql_query(sql)

OperationalError: near "alter": syntax error

In [69]:
#Index

sql="create view coo as select id, firstname,secondname from student"

sql_query(sql)

[]

In [70]:
sql="select * from coo"

sql_query(sql)

[(1, 'Mohit', 'Tomar'),
 (2, 'Swati', 'Tomar'),
 (3, 'Ajay', 'Panwar'),
 (4, 'Rakesh', 'Devi'),
 (5, 'Monika', 'Goliyan'),
 (6, 'Tabu', 'Tomar'),
 (7, 'Gaurav', 'Sirohi'),
 (8, 'Monu', None),
 (9, 'Siddharth', 'jhunjhun wala'),
 (10, 'sameer', 'jhoka')]